app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "こんにちは"], ["body", "あああああああ"], ["created_at", "2020-10-02 14:16:10.144613"], ["updated_at", "2020-10-02 14:16:10.144613"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(books_params)
    if @book.save
      flash[:notice] = "Book was successfully created."
      redirect_to "/books/#{@book.id}"
    else
      # renderはアクションを経由しないので、再定義
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "アイウエオ"], ["body", "構文"], ["updated_at", "2020-10-04 11:30:35.379099"], ["id", 13]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(books_params)